import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class Privacy extends StatelessWidget {
  const Privacy({super.key});

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      title: 'Privacy Policy',
      home: Scaffold(
        appBar: AppBar(
          title: Text('سياسة الخصوصية'),
          centerTitle: true,
        ),
        body: const SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [

              Padding(
                  padding: EdgeInsets.all(14.0),
                child: Text( "نطبق سياسة الخصوصية هذه على جميع المعلومات الشخصية التي يتم جمعها خلال أي اتصالات مكتوبة أو إلكترونية أو شفهية أو يتم جمعها عبر الإنترنت أو دون اتصال بالإنترنت."
                      ),
              ),

              Padding(
                padding: EdgeInsets.all(14.0),
                child: Text( "يرجى قراءة  هذه السياسة قبل الوصول إلى خدماتنا أو استخدامها. إذا لم تتمكن من الموافقة على هذه السياسة أو الشروط والأحكام، فالرجاء عدم الوصول إلى خدماتنا أو استخدامها. إذا كنت مقيماً في نطاق خارج المنطقة الاقتصادية الأوروبية، باستخدام خدماتنا، فأنت توافق على الشروط والأحكام وتقبل ممارسات الخصوصية الموضحة في هذه السياسة."
                ),
              ),

              Padding(
                padding: EdgeInsets.all(14.0),
                child: Text( "يجوز لنا تعديل هذه السياسة في أي وقت، دون إشعار مسبق، وقد يتم تطبيق التغييرات على أي معلومات شخصية نحتفظ بها بالفعل عنك، وكذلك أي معلومات شخصية جديدة يتم جمعها بعد تعديل السياسة. إذا أجرينا تغييرات، فسوف نعلمك عن طريق مراجعة التاريخ في الجزء العلوي من هذه السياسة. سنقدم لك إشعاراً متقدماً إذا قمنا بإجراء أي تغييرات جوهرية على كيفية جمع أو استخدام أو الكشف عن معلوماتك الشخصية التي تؤثر على حقوقك بموجب هذه السياسة. إذا كنت مقيماً في ولاية قضائية غير المنطقة الاقتصادية الأوروبية أو المملكة المتحدة أو سويسرا (مجتمعة الدول الأوروبية) ، فإن استمرار وصولك أو استخدامك لخدماتنا بعد تلقي إشعار بالتغييرات، يشكل اعترافاً منك بقبول تحديث السياسات."
                ),
              ),

              Padding(
                padding: EdgeInsets.all(14.0),
                child: Text( "بالإضافة إلى ذلك، قد نوفر لك إفصاحات في الوقت الفعلي أو معلومات إضافية حول ممارسات التعامل مع المعلومات الشخصية لأجزاء معينة من خدماتنا. قد تكمل هذه الإشعارات هذه السياسة أو توفر لك خيارات إضافية حول كيفية معالجة معلوماتك الشخصية"
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 20.0 , bottom: 7.0, left: 14.0, right: 14.0),
                child: Text( "1. المعلومات الشخصية التي نجمعها" ,
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 7.0 , bottom: 20.0, left: 14.0, right: 14.0),
                child: Text( "نقوم بجمع المعلومات الشخصية عند استخدامك لخدماتنا أو إنشاء حساب معنا أو إرسال معلومات شخصية عند الطلب من الموقع. المعلومات الشخصية عموماً هي أي معلومات تتعلق بك أو تحدد هويتك شخصياً أو يمكن استخدامها لتحديد هويتك، مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك وعنوانك ورقم حساب الدفع. يختلف تعريف المعلومات الشخصية حسب الاختصاص. ينطبق فقط التعريف الذي ينطبق عليك بناءً على موقعك، بموجب سياسة الخصوصية هذه. لا تتضمن المعلومات الشخصية بيانات تم إخفاء هويتها أو تجميعها بشكل لا رجعة فيه، بحيث لم تعد قادرة على تمكيننا، سواء بالاقتران مع معلومات أخرى أو غير ذلك، من التعرف عليك."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 20.0 , bottom: 7.0, left: 14.0, right: 14.0),
                child: Text( "2. كيف نستخدم معلوماتك الشخصية" ,
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 7.0 , bottom: 10.0, left: 14.0, right: 14.0),
                child: Text( "سنستخدم معلوماتك الشخصية فقط كما هو موضح في سياسة الخصوصية هذه أو كما تم الكشف عنها قبل إجراء هذه المعالجة."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 10.0 , bottom: 10.0, left: 14.0, right: 14.0),
                child: Text( "A. لنقدم لك خدماتنا : سنستخدم معلوماتك الشخصية لتوفير المعلومات أو أداء الخدمات التي تطلبها، بما في ذلك إدارة طلبك كمستخدم مسجل لموقعنا. إذا تم تقديم المعلومات المعمول بها أو كان من المقرر أن تؤدي الخدمة من قبل طرف ثالث، فسوف نقوم بالكشف عن المعلومات المعمول بها للطرف الثالث الذي يقوم بتقديم المعلومات أو أداء الخدمات المعمول بها. جميع الأطراف الثالثة التي نعمل معها ملزمة تعاقدياً بحماية معلوماتك كما هو موضح في سياسة الخصوصية هذه."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 10.0 , bottom: 10.0, left: 14.0, right: 14.0),
                child: Text( "B. للاستخدام الداخلي : نحن نستخدم معلوماتك الشخصية لأغراض تعزيز أعمالنا، بما في ذلك تحسين محتوى ووظائف موقعنا من خلال تحليل أين وعلى أي نوع من أنواع الأجهزة وكيفية استخدام موقعنا، وعدد الزوار الذين نتلقاهم، والموقع الذي يقومون بالنقر على موقعنا من خلاله. نستخدمها أيضاً لتذكيرك في حالة قيامك بإعادة زيارة موقعنا، حتى نعلم ما إذا كان قد تم تقديمك لك بالفعل مع الاستطلاعات أو (حيث يخضع محتوى الموقع للاختبار) أي إصدار من المحتوى الذي تم تقديمه لك."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 10.0 , bottom: 10.0, left: 14.0, right: 14.0),
                child: Text( "C. لضمان أمن الخدمات : نحن نهتم بالحفاظ على سلامتك وأمنك أثناء استخدام خدماتنا. يتطلب الحفاظ على أمانك معالجة معلوماتك الشخصية، مثل معلومات جهازك ومعلومات النشاط والمعلومات الأخرى ذات الصلة. نستخدم هذه المعلومات لمكافحة الرسائل غير المرغوب فيها أو البرامج الضارة أو الأنشطة الضارة أو المخاطر الأمنية؛ تحسين وتنفيذ تدابير الأمن لدينا؛ ومراقبة هويتك والتحقق منها حتى لا يتمكن المستخدمون غير المصرح لهم من الوصول إلى معلوماتك. لا يمكننا ضمان أمن خدماتنا إذا لم نعالج معلوماتك الشخصية لأغراض أمنية."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 10.0 , bottom: 10.0, left: 14.0, right: 14.0),
                child: Text( "D. لفرض الامتثال لشروطنا واتفاقاتنا أو سياساتنا : عندما تصل إلى خدماتنا أو تستخدمها، فأنت ملزم بالشروط والأحكام الخاصة بنا. لضمان امتثالك لها، نقوم بمعالجة معلوماتك الشخصية من خلال المراقبة النشطة والتحقيق ومنع ومنع أي أنشطة مزعومة أو فعلية محظورة أو غير مشروعة أو غير قانونية على خدماتنا. وفقًا للقانون المعمول به، يجوز لنا أيضاً معالجة معلوماتك الشخصية من أجل: التحقيق أو منع أو تخفيف انتهاكات البنود أو الاتفاقيات أو السياسات الداخلية الخاصة بنا وفرض اتفاقياتنا مع أطراف ثالثة وشركاء أعمال."
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 20.0 , bottom: 7.0, left: 14.0, right: 14.0),
                child: Text( "3. الاحتياطات الأمنية" ,
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),

              Padding(
                padding: EdgeInsets.only(top: 10.0, left: 14.0, right: 14.0, bottom: 50.0),
                child: Text( "نحافظ على الضمانات المادية والإلكترونية والإجرائية المصممة لحماية ومنع إساءة استخدام معلوماتك الشخصية. تشتمل تدابير الأمان الخاصة بنا على تدابير مادية وفنية وإدارية وفقاً لمعايير الصناعة لمنع الوصول غير المصرح به إلى معلوماتك أو الكشف عنها، والحفاظ على دقة البيانات، وضمان الاستخدام المناسب للمعلومات، وحماية معلوماتك الشخصية بطريقة أخرى. نحن نقيد الوصول إلى معلوماتك الشخصية غير العامة على هؤلاء الموظفين والأطراف الثالثة الذين يحتاجون إلى هذه المعلومات لتقديم منتجات أو خدمات."
                ),
              ),

                    ],

                ),
              )

          ),
        );
  }
}
